Repository: safe-driver-cluster/safe-driver-passenger-app
Catalog: lib/l10n/arb/app_*.arb
Languages: si

# appName
source: SafeDriver Passenger
si: ආරක්ෂිත රියදුරු මගී

# appTagline
source: Your Safety, Our Priority
si: ඔබේ ආරක්ෂාව, අපේ ප්‍රමුඛතාවය

source: Login
si: පිවිසෙන්න

source: Register
si: ලියාපදිංචි වන්න

source: Logout
si: ඉවත්වන්න

source: Email
si: ඊමේල්

source: Password
si: මුරපදය

source: Confirm Password
si: මුරපදය තහවුරු කරන්න

source: Forgot Password?
si: මුරපදය අමතකද?

source: Reset Password
si: මුරපදය නැවත සකසන්න

source: Create Account
si: ගිණුමක් සාදන්න

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?

# loginSuccess
source: Login successful
si: සාර්ථකව පිවිසෙන ලදී

source: Login failed
si: පිවිසීම අසාර්ථකයි

# registrationSuccess
source: Registration successful
si: සාර්ථකව ලියාපදිංචි විය

source: Registration failed
si: ලියාපදිංචිය අසාර්ථකයි

source: OTP Verification
si: OTP තහවුරු කිරීම

source: Enter OTP
si: OTP ඇතුළත් කරන්න

# otpSent
source: OTP sent to
si: OTP යවා ඇත

source: Resend OTP
si: OTP නැවත යවන්න

source: OTP expired
si: OTP කල් ඉකුත් විය

source: Invalid OTP
si: වලංගු නොවන OTP

source: Verify OTP
si: OTP තහවුරු කරන්න

source: Dashboard
si: උපකරණ පුවරුව

source: Safety Overview
si: ආරක්ෂක සමාලෝචනය

source: Quick Actions
si: ඉක්මන් ක්‍රියා

source: Recent Activity
si: මෑත ක්‍රියාකාරකම්

source: Active Journey
si: සක්‍රිය ගමන

source: No active journey
si: සක්‍රිය ගමනක් නැත

source: Safety Score
si: ආරක්ෂක ලකුණු

source: Fleet Status
si: බහාලුම් තත්ත්වය

source: Home
si: මුල් පිටුව

source: Search
si: සොයන්න

source: History
si: ඉතිහාසය

source: Profile
si: පැතිකඩ

source: Settings
si: සැකසුම්

source: Notifications
si: දැනුම්දීම්

source: Bus Information
si: බස් තොරතුරු

source: Bus Details
si: බස් විස්තර

source: Bus Number
si: බස් අංකය

source: Route Number
si: මාර්ග අංකය

source: Driver Name
si: රියදුරුගේ නම

source: Current Location
si: වර්තමාන ස්ථානය

source: Next Stop
si: ඊළඟ නැවතුම

source: Estimated Arrival
si: ඇස්තමේන්තු පැමිණීම

source: Passenger Capacity
si: මගී ධාරිතාව

source: Bus Status
si: බස් තත්ත්වය

source: Live Tracking
si: සජීවී ලුහුබැඳීම

source: Track Bus
si: බස් ලුහුබඳින්න

source: Bus History
si: බස් ඉතිහාසය

source: Search Bus
si: බස් සොයන්න

source: Scan QR Code
si: QR කේතය ස්කෑන් කරන්න

source: Driver Information
si: රියදුරු තොරතුරු

source: Driver Profile
si: රියදුරුගේ පැතිකඩ

source: Driver History
si: රියදුරුගේ ඉතිහාසය

source: Driver Performance
si: රියදුරුගේ කාර්ය සාධනය

source: Driver Rating
si: රියදුරුගේ ශ්‍රේණිගතකිරීම

# driverExperience
source: Experience
si: අත්දැකීම්

# driverLicense
source: License
si: බලපත්‍රය

# driverCertifications
source: Certifications
si: සහතික

# driverContact
source: Contact
si: සම්බන්ධතාව

source: Driver Status
si: රියදුරුගේ තත්ත්වය

source: Alertness Level
si: අවධානත්වයේ මට්ටම

source: Safety
si: ආරක්ෂාව

source: Safety Alerts
si: ආරක්ෂක අනතුරු ඇඟවීම්

source: Emergency Alert
si: හදිසි අනතුරු ඇඟවීම

source: Hazard Zones
si: අන්තරාය කලාප

source: Emergency Contacts
si: හදිසි සම්බන්ධතා

source: Call Emergency
si: හදිසි ඇමතුම

source: Report Incident
si: සිද්ධිය වාර්තා කරන්න

source: Safety Tips
si: ආරක්ෂක ඉඟි

source: Weather Warning
si: කාලගුණ අනතුරු ඇඟවීම

source: Road Conditions
si: මාර්ග තත්ත්වයන්

source: Traffic Alert
si: රථවාහන අනතුරු ඇඟවීම

source: Feedback
si: ප්‍රතිසාදය

source: Submit Feedback
si: ප්‍රතිසාදය ඉදිරිපත් කරන්න

source: Feedback History
si: ප්‍රතිසාද ඉතිහාසය

source: Rate Bus
si: බස් ශ්‍රේණිගත කරන්න

source: Rate Driver
si: රියදුරු ශ්‍රේණිගත කරන්න

source: Report Problem
si: ගැටලුව වාර්තා කරන්න

source: Suggestion
si: යෝජනාව

source: Complaint
si: පැමිණිල්ල

source: Compliment
si: ප්‍රශංසාව

# feedbackSubmitted
source: Feedback submitted successfully
si: ප්‍රතිසාදය සාර්ථකව ඉදිරිපත් විය

source: General
si: සාමාන්‍ය

source: Language Settings
si: භාෂා සැකසුම්

source: Select Language
si: භාෂාව තෝරන්න

source: Notification Settings
si: දැනුම්දීමේ සැකසුම්

source: Push Notifications
si: තල්ලු දැනුම්දීම්

source: Email Notifications
si: ඊමේල් දැනුම්දීම්

source: Dark Mode
si: අඳුරු ප්‍රකාරය

source: Auto Mode
si: ස්වයංක්‍රිය ප්‍රකාරය

source: Light Mode
si: ආලෝක ප්‍රකාරය

source: Font Size
si: අක්ෂර ප්‍රමාණය

source: Privacy
si: පෞද්ගලිකත්වය

source: Data Usage
si: දත්ත භාවිතය

source: Location
si: ස්ථානය

source: Account
si: ගිණුම

source: Change Password
si: මුරපදය වෙනස් කරන්න

source: Delete Account
si: ගිණුම මකන්න

source: Save
si: සුරකින්න

source: Cancel
si: අවලංගු කරන්න

source: OK
si: හරි

source: Yes
si: ඔව්

source: No
si: නැහැ

source: Done
si: සම්පූර්ණයි

source: Next
si: ඊළඟ

source: Previous
si: කලින්

source: Skip
si: මඟ හරින්න

source: Retry
si: නැවත උත්සාහ කරන්න

source: Refresh
si: නැවුම් කරන්න

source: Loading...
si: පූරණය වෙමින්...

source: Updating...
si: යාවත්කාල කරමින්...

source: Searching...
si: සොයමින්...

source: Processing...
si: සැකසෙමින්...

source: Error
si: දෝෂය

# errorOccurred
source: An error occurred
si: දෝෂයක් ඇති විය

source: Network error
si: ජාල දෝෂය

source: Server error
si: සේවාදායක දෝෂය

source: Connection timeout
si: සම්බන්ධතාවය කල් ඉකුත්

source: No internet connection
si: අන්තර්ජාල සම්බන්ධතාවයක් නැත

source: Data missing
si: දත්ත අස්ථානගත

source: Invalid input
si: වලංගු නොවන ආදානය

# requiredField
source: This field is required
si: මෙම ක්ෂේත්‍රය අවශ්‍යයි

# tryAgainLater
source: Please try again later
si: කරුණාකර පසුව නැවත උත්සාහ කරන්න

source: Success
si: සාර්ථකත්වය

source: Operation successful
si: ක්‍රියාකාරිත්වය සාර්ථකයි

# dataSaved
source: Data saved successfully
si: දත්ත සාර්ථකව සුරකින ලදී

# dataUpdated
source: Data updated successfully
si: දත්ත සාර්ථකව නවීකරණය විය

# dataDeleted
source: Data deleted successfully
si: දත්ත සාර්ථකව මකා දමන ලදී

# noData
source: No data available
si: දත්ත නොමැත

# noResults
source: No results found
si: ප්‍රතිඵල නොමැත

# noBuses
source: No buses found
si: බස් නොමැත

# noDrivers
source: No drivers found
si: රියදුරන් නොමැති

source: No notifications
si: දැනුම්දීම් නොමැත

# noHistory
source: No history available
si: ඉතිහාසයක් නොමැත

# noFeedback
source: No feedback submitted
si: ප්‍රතිසාදයක් ඉදිරිපත් කර නැත

# noAlerts
source: No active alerts
si: සක්‍රිය අනතුරු ඇඟවීම් නොමැත

source: Today
si: අද

source: Yesterday
si: ඊයේ

source: Tomorrow
si: හෙට

source: This Week
si: මෙම සතිය

source: Last Week
si: පසුගිය සතිය

source: This Month
si: මෙම මාසය

source: Last Month
si: පසුගිය මාසය

source: minutes
si: මිනිත්තු

source: hours
si: පැය

source: days
si: දින

source: weeks
si: සති

source: months
si: මාස

# emailRequired
source: Email is required
si: ඊමේල් අවශ්‍යයි

# passwordRequired
source: Password is required
si: මුරපදය අවශ්‍යයි

# invalidEmail
source: Invalid email format
si: වලංගු නොවන ඊමේල් ආකෘතිය

# passwordTooShort
source: Password must be at least 8 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 8 ක් විය යුතුය

source: Passwords do not match
si: මුරපද නොගැලපේ

# phoneRequired
source: Phone number is required
si: දුරකථන අංකය අවශ්‍යයි

# invalidPhone
source: Invalid phone number
si: වලංගු නොවන දුරකථන අංකය

# nameRequired
source: Name is required
si: නම අවශ්‍යයි

# welcomeTitle
source: Welcome to SafeDriver
si: ආරක්ෂිත රියදුරුට සාදරයෙන් පිළිගන්න

# onboarding1Title
source: Track Buses in Real-time
si: සජීවී බස් ලුහුබැඳීම

# onboarding1Description
source: Monitor your bus location and get accurate arrival times
si: ඔබේ බස් ස්ථානය නිරීක්ෂණය කර නිවැරදි පැමිණීමේ වේලාවන් ලබා ගන්න

# onboarding2Title
source: Driver Safety Monitoring
si: රියදුරු ආරක්ෂක නිරීක්ෂණය

# onboarding2Description
source: Real-time alerts for driver drowsiness and distraction
si: රියදුරුගේ නින්දට යාම සහ අවධානය වෙනතකට යෑම සඳහා සජීවී අනතුරු ඇඟවීම්

# onboarding3Title
source: Emergency Response
si: හදිසි ප්‍රතිචාරය

# onboarding3Description
source: Quick access to emergency services and safety features
si: හදිසි සේවා සහ ආරක්ෂක විශේෂාංග වෙත ඉක්මන් ප්‍රවේශය

source: Get Started
si: ආරම්භ කරන්න

source: About
si: ගැන

source: Version
si: අනුවාදය

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

source: Terms of Service
si: සේවා කොන්දේසි

source: Contact Support
si: සහාය සම්බන්ධ කරන්න

source: Rate App
si: යෙදුම ශ්‍රේණිගත කරන්න

source: Share App
si: යෙදුම බෙදා ගන්න

source: Legal
si: නීතිමය

source: Licenses
si: බලපත්‍ර

source: Emergency
si: හදිසි

source: Police
si: පොලිසිය

source: Medical
si: වෛද්‍ය

# fire
source: Fire Department
si: ගිනි නිවන දෙපාර්තමේන්තුව

source: Call Now
si: දැන් අමතන්න

source: Emergency Hotline
si: හදිසි උණුසුම් රේඛාව

source: Police Station
si: පොලිස් ස්ථානය

source: Hospital
si: රෝහල

source: Fire Station
si: ගිනි නිවන ස්ථානය

# alwaysWearSeatbelt
source: Always wear your seatbelt
si: සැමවිටම ආසන පටිය පළඳින්න

# stayAlert
source: Stay alert and aware of your surroundings
si: සැමවිටම අවධානයෙන් සහ ඔබේ පරිසරය ගැන දැනුවත්ව සිටින්න

# keepEmergencyContacts
source: Keep emergency contacts readily available
si: හදිසි සම්බන්ධතා සූදානම්ව තබා ගන්න

# reportSuspiciousActivity
source: Report any suspicious activity immediately
si: සැක සහිත ක්‍රියාකාරකම් වහාම වාර්තා කරන්න

# followBusSafety
source: Follow bus safety protocols and driver instructions
si: බස් ආරක්ෂක ප්‍රොටෝකෝල සහ රියදුරුගේ උපදෙස් අනුගමනය කරන්න

source: Close
si: වසන්න

source: Book Ticket
si: ටිකට් පත්‍රය වෙන්කරවන්න

source: Coming Soon
si: ඉදිරියේදී

source: Track Live
si: සජීවී ලුහුබඳින්න

source: Share
si: බෙදා ගන්න

# shareFunctionality
source: Share functionality will be implemented
si: බෙදාගැනීමේ ක්‍රියාකාරිත්වය ක්‍රියාත්මක කරනු ලැබේ

# reportedBy
source: Reported by: {name}
si: {name} විසින් වාර්තා කරන ලදී

# busIdLabel
source: Bus ID: {busId}
si: බස් හැඳුනුම: {busId}

# driverIdLabel
source: Driver ID: {driverId}
si: රියදුරු හැඳුනුම: {driverId}

source: Language
si: භාෂාව

source: System Default
si: පද්ධති පෙරනිමිය

source: Acknowledge
si: පිළිගන්න

source: View Details
si: විස්තර බලන්න

source: View Profile
si: පැතිකඩ බලන්න

source: Contact
si: සම්බන්ධ කරන්න

source: View All
si: සියල්ල බලන්න

source: Scan QR
si: QR ස්කෑන් කරන්න

source: Try Again
si: නැවත උත්සාහ කරන්න

source: Go Back
si: ආපසු යන්න

source: Open Settings
si: සැකසුම් විවෘත කරන්න

source: Details
si: විස්තර

source: Track
si: ලුහුබඳින්න

# safetyTipsTitle
source: Safety Tips
si: ආරක්ෂක ඉඟි

source: Safety Hub
si: ආරක්ෂක මධ්‍යස්ථානය

source: Report Safety Issue
si: ආරක්ෂක ගැටලුව වාර්තා කරන්න

source: Report
si: වාර්තාව

source: Got it
si: තේරුණා

# safetyAlertsTitle
source: Safety Alerts
si: ආරක්ෂක අනතුරු ඇඟවීම්

# reportIncidentTitle
source: Report Incident
si: සිද්ධිය වාර්තා කරන්න

# hazardZonesTitle
source: Hazard Zones
si: අන්තරාය කලාප

# emergencyContactsTitle
source: Emergency Contacts
si: හදිසි සම්බන්ධතා

source: Enter Code Manually
si: කේතය අතින් ඇතුළු කරන්න

# qrCodeDetected
source: QR Code detected: {code}
si: QR කේතය සොයා ගන්නා ලදී: {code}

source: Sign Out
si: ඉවත් වන්න

# areYouSureSignOut
source: Are you sure you want to sign out?
si: ඔබට ඉවත් වීමට අවශ්‍යද?

source: Trip History
si: ගමන් ඉතිහාසය

source: Review
si: සමාලෝචනය

# tripDetails
source: Trip {id}
si: ගමන {id}

source: Give Feedback
si: ප්‍රතිසාදය ලබා දෙන්න

# comingSoonFeature
source: This feature will be available in a future update.
si: මෙම විශේෂාංගය අනාගත යාවත්කාලීනයකදී ලබා ගත හැකිය.

source: Clear Cache
si: කෑෂය මකන්න

source: Cache cleared successfully!
si: කෑෂය සාර්ථකව මකා දමන ලදී!

source: Clear
si: මකන්න

# profileTitle
source: Profile
si: පැතිකඩ

source: Profile updated successfully
si: පැතිකඩ සාර්ථකව යාවත්කාලීන විය

# failedToUpdateProfile
source: Failed to update profile: {error}
si: පැතිකඩ යාවත්කාලීන කිරීම අසාර්ථකයි: {error}

source: My Profile
si: මගේ පැතිකඩ

source: No profile found
si: පැතිකඩක් හමු නොවීය

source: View FAQ
si: නිති අසන ප්‍රශ්න බලන්න

source: Change Picture
si: රූපය වෙනස් කරන්න

# profileUpdated
source: Profile updated successfully!
si: පැතිකඩ සාර්ථකව යාවත්කාලීන විය!

# aboutTitle
source: About
si: ගැන

source: Page Not Found
si: පිටුව හමු නොවීය

source: Search functionality coming soon!
si: සොයන්න ක්‍රියාකාරිත්වය ඉක්මනින් පැමිණේ!

source: Bus routes coming soon!
si: බස් මාර්ග ඉක්මනින් පැමිණේ!

source: Navigation coming soon!
si: සංචාලනය ඉක්මනින් පැමිණේ!

# selected
source: Selected: {description}
si: තෝරාගත්: {description}

# placeLookupFailed
source: Place lookup failed: {error}
si: ස්ථානය සොයාගැනීම අසාර්ථකයි: {error}

# foundBusStopsNearby
source: Found {count} bus stops nearby
si: ආසන්නයේ බස් නැවතුම් {count} ක් හමුවිය

# foundQueryTapNavigate
source: Found "{query}". Tap Navigate to see bus route!
si: "{query}" හමුවිය. බස් මාර්ගය බැලීමට Navigate ටැප් කරන්න!

# searchFailed
source: Search failed: {error}
si: සෙවුම අසාර්ථකයි: {error}

source: Unable to get current location
si: වර්තමාන ස්ථානය ලබාගත නොහැක

# pleaseSearchForDestination
source: Please search for a destination first
si: කරුණාකර මුලින්ම ගමනාන්තයක් සොයන්න

# errorSelectingLanguage
source: Error selecting language: {error}
si: භාෂාව තෝරාගැනීමේ දෝෂය: {error}

source: Hazard Zone Intelligence
si: අන්තරාය කලාප බුද්ධිය

source: Loading hazard zone data...
si: අන්තරාය කලාප දත්ත පූරණය වෙමින්...

# driverIdRequiredForAlerts
source: Driver ID required to view alerts
si: අනතුරු ඇඟවීම් බැලීමට රියදුරු හැඳුනුම අවශ්‍යයි

source: No active hazard alerts
si: සක්‍රිය අන්තරාය අනතුරු ඇඟවීම් නැත

# reviewsTitle
source: Reviews
si: සමාලෝචන

source: Back
si: ආපසු

source: Add Media
si: මාධ්‍ය එක් කරන්න

source: Take Photo
si: ඡායාරූපයක් ගන්න

source: Choose from Gallery
si: ගැලරියෙන් තෝරන්න

# fileTooLarge
source: {fileName} is too large. Maximum size is 10MB.
si: {fileName} ඉතා විශාලයි. උපරිම ප්‍රමාණය 10MB ය.

# locationPermissionRequired
source: Location permission is required to share location
si: ස්ථානය බෙදාගැනීමට ස්ථාන අනුමතිය අවශ්‍යයි

# failedToGetLocation
source: Failed to get location: {error}
si: ස්ථානය ලබාගැනීම අසාර්ථකයි: {error}

# incidentReportingImplemented
source: Incident reporting will be implemented
si: සිද්ධි වාර්තාකරණය ක්‍රියාත්මක කරනු ලැබේ

source: Priority
si: ප්‍රමුඛතාවය

source: Low
si: අඩු

source: Medium
si: මධ්‍යම

source: High
si: ඉහළ

source: Urgent
si: හදිසි

source: Submit anonymously
si: නිර්නාමිකව ඉදිරිපත් කරන්න

# personalInfoNotShared
source: Your personal information will not be shared
si: ඔබේ පෞද්ගලික තොරතුරු බෙදාගනු නොලැබේ

source: Choose Your Language
si: ඔබේ භාෂාව තෝරන්න

# selectYourPreferredLanguage
source: Select your preferred language to continue
si: ඉදිරියට යාමට ඔබේ කැමති භාෂාව තෝරන්න

source: Available Languages
si: ලබාගත හැකි භාෂා

# continueButton
source: Continue
si: ඉදිරියට

source: Profile Page - Coming Soon
si: පැතිකඩ පිටුව - ඉක්මනින් එනවා

source: Edit Profile
si: පැතිකඩ සංස්කරණය

source: Loading profile...
si: පැතිකඩ පූරණය වෙමින්...

source: Profile Picture
si: පැතිකඩ රූපය

source: Basic Information
si: මූලික තොරතුරු

source: Email Address
si: විද්‍යුත් තැපැල් ලිපිනය

source: No email
si: විද්‍යුත් තැපෑල නැත

source: First Name
si: මුල් නම

source: Last Name
si: අවසාන නම

source: Date of Birth
si: උපන් දිනය

source: Gender
si: ලිංගය

source: Address Information
si: ලිපින තොරතුරු

source: Street Address
si: වීදි ලිපිනය

source: City
si: නගරය

source: State
si: ප්‍රාන්තය

source: ZIP Code
si: ZIP කේතය

source: Country
si: රට

source: Emergency Contact
si: හදිසි සම්බන්ධතාවය

source: Contact Name
si: සම්බන්ධතා නම

source: Relationship
si: සම්බන්ධතාවය

source: Preferences
si: මනාපයන්

source: Camera Error
si: කැමරා දෝෂය

# positionQrCode
source: Position QR code here
si: QR කේතය මෙහි තබන්න

source: QR Scanner
si: QR ස්කෑනර්

# scanQrInstruction
source: Scan QR code on bus or stop
si: බස් හෝ නැවතුමේ QR කේතය ස්කෑන් කරන්න

# alignQrInstruction
source: Hold steady and align QR code within the frame
si: ස්ථිරව තබාගෙන QR කේතය රාමුව තුළ සමගාමී කරන්න

# enterBusStopCode
source: Enter bus or stop code
si: බස් හෝ නැවතුම් කේතය ඇතුළු කරන්න

source: Submit
si: යොමු කරන්න

source: Maps & Navigation
si: සිතියම් සහ සංචාලනය

# searchDestination
source: Search for destination...
si: ගමනාන්තය සොයන්න...

source: Bus Stop
si: බස් නැවතුම

source: Navigate
si: සංචාලනය

source: Your Location
si: ඔබේ ස්ථානය

source: Current position
si: වත්මන් ස්ථානය

source: Unable to load map
si: සිතියම පූරණය කළ නොහැක

source: Loading map...
si: සිතියම පූරණය වෙමින්...

source: Bus Route to Destination
si: ගමනාන්තයට බස් මාර්ගය
